In [1]:
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import numpy as np
data1 = pd.read_csv('C:/Users/aksha/Desktop/Data Science/car_purchasing.csv')
data1.head()
data2 = pd.read_csv('C:/Users/aksha/Desktop/Data Science/countryContinent.csv',encoding = "ISO-8859-1")

data2.head()

,country,code_2,code_3,country_code,iso_3166_2,continent,sub_region,region_code,sub_region_code
0,Afghanistan,AF,AFG,4,ISO 3166-2:AF,Asia,Southern Asia,142.0,34.0
1,Åland Islands,AX,ALA,248,ISO 3166-2:AX,Europe,Northern Europe,150.0,154.0
2,Albania,AL,ALB,8,ISO 3166-2:AL,Europe,Southern Europe,150.0,39.0
3,Algeria,DZ,DZA,12,ISO 3166-2:DZ,Africa,Northern Africa,2.0,15.0
4,American Samoa,AS,ASM,16,ISO 3166-2:AS,Oceania,Polynesia,9.0,61.0

In [2]:
data1.head()

,customer name,JobTitle,customer e-mail,country,gender,age,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,credit card debt,net worth,car purchase amount
0,Martina Avila,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,42,167411.18,0.00,400184.25,NaN,567595.43,567595.43,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,CAPTAIN III (POLICE DEPARTMENT),eu.dolor@diam.co.uk,Belize,0,41,155966.02,245131.88,137811.38,NaN,538909.28,538909.28,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,CAPTAIN III (POLICE DEPARTMENT),vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43,212739.13,106088.18,16452.60,NaN,335279.91,335279.91,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,WIRE ROPE CABLE MAINTENANCE MECHANIC,malesuada@dignissim.com,Cook Islands,1,58,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,14426.164850,548599.0524,67422.36313
4,Cedric Leach,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57,134401.60,9737.00,182234.59,NaN,326373.19,326373.19,5358.712177,560304.0671,55915.46248

In [3]:
df1 = data1[['country','car purchase amount']]
df2 = data1[['country','net worth']]
df1 = df1.groupby(['country']).agg({'car purchase amount':'mean'})
df2 = df2.groupby(['country']).agg({'net worth':'mean'})
df1.head()
df2.head()

                    net worth
country
Afghanistan     342533.579375
Algeria         539669.883120
American Samoa  320834.010200
Andorra         472957.648500
Angola          454485.529200

In [4]:
df1.head()

                car purchase amount
country
Afghanistan            56017.850725
Algeria                47752.068330
American Samoa         24221.999370
Andorra                39239.699943
Angola                 44498.000075

In [5]:
car_data = pd.merge(df1, df2, on="country")
car_data.head()

                car purchase amount      net worth
country
Afghanistan            56017.850725  342533.579375
Algeria                47752.068330  539669.883120
American Samoa         24221.999370  320834.010200
Andorra                39239.699943  472957.648500
Angola                 44498.000075  454485.529200

In [6]:
data2.nunique()

country            249
code_2             248
code_3             249
country_code       249
iso_3166_2         249
continent            5
sub_region          22
region_code          5
sub_region_code     22
dtype: int64

In [7]:
data2.country.nunique()

249

In [8]:
country_data = data2[['country','continent','sub_region']]
country_data.head()

          country continent       sub_region
0     Afghanistan      Asia    Southern Asia
1   Åland Islands    Europe  Northern Europe
2         Albania    Europe  Southern Europe
3         Algeria    Africa  Northern Africa
4  American Samoa   Oceania        Polynesia

In [10]:
final_data = pd.merge(car_data, country_data, on="country")
final_data.head()

,country,car purchase amount,net worth,continent,sub_region
0,Afghanistan,56017.850725,342533.579375,Asia,Southern Asia
1,Algeria,47752.068330,539669.883120,Africa,Northern Africa
2,American Samoa,24221.999370,320834.010200,Oceania,Polynesia
3,Andorra,39239.699943,472957.648500,Europe,Southern Europe
4,Angola,44498.000075,454485.529200,Africa,Middle Africa

In [11]:
final_data.continent.nunique()

5

In [12]:
final_data.continent.unique()

array(['Asia', 'Africa', 'Oceania', 'Europe', 'Americas', nan],
      dtype=object)

In [13]:
print(final_data)

               country  car purchase amount      net worth continent  \
0          Afghanistan         56017.850725  342533.579375      Asia
1              Algeria         47752.068330  539669.883120    Africa
2       American Samoa         24221.999370  320834.010200   Oceania
3              Andorra         39239.699943  472957.648500    Europe
4               Angola         44498.000075  454485.529200    Africa
..                 ...                  ...            ...       ...
182  Wallis and Futuna         53153.921810  426298.253800   Oceania
183     Western Sahara         44318.569955  486416.971050    Africa
184              Yemen         52960.391330  542472.995233      Asia
185           Zimbabwe         34602.865580  361990.148000    Africa
186      Åland Islands         51012.696863  523111.117200    Europe

          sub_region
0      Southern Asia
1    Northern Africa
2          Polynesia
3    Southern Europe
4      Middle Africa
..               ...
182        Polynesia
183  Northern Africa
184     Western Asia
185   Eastern Africa
186  Northern Europe

[187 rows x 5 columns]

In [15]:
final_data.isnull().values.any()

True

In [16]:
final_data.isna().sum().sum()

12

In [17]:
final_data['country'].isna().sum()
final_data['car purchase amount'].isna().sum()
final_data['net worth'].isna().sum()
final_data['continent'].isna().sum()
final_data['sub_region'].isna().sum()

6

In [18]:
final_data.to_csv('out.csv')

In [20]:
final = final_data.dropna()

In [21]:
final.isnull().values.any()

False

In [25]:
final_data.continent.unique()
final.sub_region.unique()

array(['Southern Asia', 'Northern Africa', 'Polynesia', 'Southern Europe',
       'Middle Africa', 'Caribbean', 'South America', 'Western Asia',
       'Australia and New Zealand', 'Western Europe', 'Eastern Europe',
       'Central America', 'Western Africa', 'Northern America',
       'Southern Africa', 'South-Eastern Asia', 'Eastern Asia',
       'Northern Europe', 'Eastern Africa', 'Micronesia', 'Central Asia',
       'Melanesia'], dtype=object)

In [24]:
final.continent.unique()

array(['Asia', 'Africa', 'Oceania', 'Europe', 'Americas'], dtype=object)

In [28]:
final.to_csv('car_price_X_continent.csv')